Revit 2026 API

# DataTransferProgressChangedEventArgs Class

---

The event arguments used during the data transferring phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged].

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPISingleEventArgs Autodesk.Revit.DB.EventsWorksharedOperationProgressChangedEventArgs Autodesk.Revit.DB.EventsDataTransferProgressChangedEventArgs Autodesk.Revit.DB.EventsCreateRelatedFileProgressChangedEventArgs Autodesk.Revit.DB.EventsDocumentReloadLatestProgressChangedEventArgs Autodesk.Revit.DB.EventsDocumentSaveToCentralProgressChangedEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DataTransferProgressChangedEventArgs : WorksharedOperationProgressChangedEventArgs
```
```vb
Public Class DataTransferProgressChangedEventArgs
	Inherits WorksharedOperationProgressChangedEventArgs
```
```cpp
public ref class DataTransferProgressChangedEventArgs : public WorksharedOperationProgressChangedEventArgs
```
```fsharp
type DataTransferProgressChangedEventArgs =
    class
        inherit WorksharedOperationProgressChangedEventArgs
    end
```

The DataTransferProgressChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | FinishedSize | The transferred data size, in bytes, since the last time this event was raised. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Location | Full path of the central model which is to be operated. (Inherited from WorksharedOperationProgressChangedEventArgs) |
|  | Speed | Speed(bytes/second) in this event. |
|  | Status | Gets API event status, reflect current operation execution status. (Inherited from WorksharedOperationProgressChangedEventArgs) |
|  | TotalSize | Total expected data size to transfer, in bytes. |
|  | TransferMode | Data transfer mode in this event. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.

#### Reference

Autodesk.Revit.DB.Events Namespace